In [86]:
import pandas as pd
import numpy as np

In [87]:
x=pd.DataFrame({i:pd.Series(np.random.randint(5, size = 30), dtype="category") for i in range(5)})

In [88]:
# x.set_axis(['V', 'W', 'X', 'Y', 'Z'], axis=1, inplace=True)
x.head()

   0  1  2  3  4
0  1  3  0  4  2
1  1  1  0  3  1
2  4  4  2  1  0
3  2  0  1  1  1
4  4  3  1  4  0

In [89]:
y=x.drop(1,axis=1)
y=y.drop(2,axis=1)
y=y.drop(4,axis=1)
y=y.drop(0,axis=1)
z=y[3].unique()
z

[4, 3, 1, 0, 2]
Categories (5, int64): [0, 1, 2, 3, 4]

In [100]:
x=pd.DataFrame({i:pd.Series(np.random.randint(5, size = 30), dtype="category") for i in range(5)})
lt=x[0].unique()
for i in lt:
    a=x.loc[x[0]==i]
    a=a.drop(1,axis=1)
#     print(a)
m=x.index[x[2] == 0].tolist()
print(m)
for i in x[4][m]:
    print(i,end=" ")

[8, 9, 12, 14, 18, 19, 22]
1 4 4 3 1 3 0

In [85]:
a=x.loc[x[3]==0]
a=a.drop(3,axis=1)
a

    0  2  4
3   3  3  1
5   1  4  4
7   2  0  0
10  2  1  4
12  2  2  3
14  0  2  4
19  3  0  3
23  4  0  4
25  1  4  2